# Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avacado'])

In [7]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [8]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0] = None

In [11]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [2]:
from numpy import nan as NA

In [13]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [17]:
cleaned = data.dropna()

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = NA

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7, 3))

In [27]:
df.iloc[:4, 1] = NA

In [28]:
df.iloc[:2, 2] = NA

In [29]:
df

          0         1         2
0  0.743392       NaN       NaN
1  0.653763       NaN       NaN
2 -1.826187       NaN  0.256853
3 -0.569573       NaN  0.277132
4  0.235970 -1.727035 -0.359147
5  1.210316  1.456498  0.230288
6 -0.441682 -0.127085  0.313532

In [30]:
df.dropna()

          0         1         2
4  0.235970 -1.727035 -0.359147
5  1.210316  1.456498  0.230288
6 -0.441682 -0.127085  0.313532

In [31]:
df.dropna(thresh=2)

          0         1         2
2 -1.826187       NaN  0.256853
3 -0.569573       NaN  0.277132
4  0.235970 -1.727035 -0.359147
5  1.210316  1.456498  0.230288
6 -0.441682 -0.127085  0.313532

## Filling In Missing Data

In [32]:
df.fillna(0)

          0         1         2
0  0.743392  0.000000  0.000000
1  0.653763  0.000000  0.000000
2 -1.826187  0.000000  0.256853
3 -0.569573  0.000000  0.277132
4  0.235970 -1.727035 -0.359147
5  1.210316  1.456498  0.230288
6 -0.441682 -0.127085  0.313532

In [33]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.743392  0.500000  0.000000
1  0.653763  0.500000  0.000000
2 -1.826187  0.500000  0.256853
3 -0.569573  0.500000  0.277132
4  0.235970 -1.727035 -0.359147
5  1.210316  1.456498  0.230288
6 -0.441682 -0.127085  0.313532

In [34]:
_ = df.fillna(0, inplace=True)

In [48]:
df

          0         1         2
0  1.289132 -1.894810  0.742240
1  0.101791  0.598942 -1.162392
2 -0.554634 -0.508748 -1.056617
3 -0.503346  1.989803  0.909047
4  1.200295  0.068934  2.024427
5  0.551199  0.756521 -1.170631

In [49]:
df = pd.DataFrame(np.random.randn(6, 3))

In [52]:
df

          0         1         2
0 -0.722657  0.579852 -0.528166
1 -0.637389  1.709186  0.842138
2 -0.441820  0.936204 -0.213015
3  0.699285  0.552498  0.785272
4  1.639125  1.962488  0.556787
5 -0.649930  0.271592 -1.044776

In [55]:
df.iloc[2:, 1] = NA

In [56]:
df.iloc[4:, 2] = NA

In [57]:
df

          0         1         2
0 -0.722657  0.579852 -0.528166
1 -0.637389  1.709186  0.842138
2 -0.441820       NaN -0.213015
3  0.699285       NaN  0.785272
4  1.639125       NaN       NaN
5 -0.649930       NaN       NaN

In [58]:
df.fillna(method='ffill')

          0         1         2
0 -0.722657  0.579852 -0.528166
1 -0.637389  1.709186  0.842138
2 -0.441820  1.709186 -0.213015
3  0.699285  1.709186  0.785272
4  1.639125  1.709186  0.785272
5 -0.649930  1.709186  0.785272

In [59]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.722657  0.579852 -0.528166
1 -0.637389  1.709186  0.842138
2 -0.441820  1.709186 -0.213015
3  0.699285  1.709186  0.785272
4  1.639125       NaN  0.785272
5 -0.649930       NaN  0.785272

In [60]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [61]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [62]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [3]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [4]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [5]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [6]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [7]:
data['v1'] = range(7)

In [12]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [15]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

## Transforming Data Using a Function or Mapping

In [17]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [18]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [19]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [20]:
lower_cased = data['food'].str.lower()

In [21]:
lower_cased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [22]:
data['animal'] = lower_cased.map(meat_to_animal)

In [23]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [25]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [26]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [27]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [28]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [29]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [30]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [31]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [32]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [33]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [34]:
transform = lambda x: x[:4].upper()

In [35]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [36]:
data.index = data.index.map(transform)

In [37]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [39]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [40]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [41]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [42]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [17]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [4]:
bins = [18, 25, 35, 60, 100]

In [5]:
cats = pd.cut(ages, bins)

In [9]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [10]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [11]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [13]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [18]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [19]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [20]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [35]:
data = np.random.randn(1000)

In [36]:
cats = pd.cut(data, 4, precision=2)

In [37]:
cats

[(-1.32, 0.38], (-3.03, -1.32], (-1.32, 0.38], (-1.32, 0.38], (-1.32, 0.38], ..., (-1.32, 0.38], (-1.32, 0.38], (-1.32, 0.38], (0.38, 2.08], (0.38, 2.08]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.03, -1.32] < (-1.32, 0.38] < (0.38, 2.08] < (2.08, 3.78]]

In [38]:
pd.value_counts(cats)

(-1.32, 0.38]     558
(0.38, 2.08]      326
(-3.03, -1.32]     90
(2.08, 3.78]       26
dtype: int64

In [39]:
data = np.random.randn(1000)

In [40]:
cats = pd.qcut(data, 4)

In [41]:
cats

[(-0.0536, 0.702], (-0.714, -0.0536], (0.702, 3.45], (-2.87, -0.714], (-2.87, -0.714], ..., (-0.0536, 0.702], (0.702, 3.45], (-0.0536, 0.702], (-0.0536, 0.702], (-0.714, -0.0536]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.87, -0.714] < (-0.714, -0.0536] < (-0.0536, 0.702] < (0.702, 3.45]]

In [42]:
pd.value_counts(cats)

(-2.87, -0.714]      250
(-0.714, -0.0536]    250
(-0.0536, 0.702]     250
(0.702, 3.45]        250
dtype: int64

In [43]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0536, 1.343], (-1.328, -0.0536], (1.343, 3.45], (-2.87, -1.328], (-1.328, -0.0536], ..., (-0.0536, 1.343], (1.343, 3.45], (-0.0536, 1.343], (-0.0536, 1.343], (-1.328, -0.0536]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.87, -1.328] < (-1.328, -0.0536] < (-0.0536, 1.343] < (1.343, 3.45]]

## Detecting and Filtering Outliers

In [46]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [48]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.015017    -0.009327    -0.010829    -0.040157
std       0.975949     0.980260     1.005068     1.002874
min      -3.367719    -3.263429    -3.379096    -2.932212
25%      -0.682590    -0.677608    -0.683984    -0.722428
50%      -0.035123    -0.006947     0.019384    -0.013082
75%       0.657671     0.651089     0.659703     0.682857
max       2.999542     3.209693     3.719684     3.137984

In [49]:
col = data[2]

In [50]:
col[np.abs(col) > 3]

175   -3.379096
252    3.448594
457    3.141148
484    3.719684
Name: 2, dtype: float64

In [55]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
25  -0.539805  3.143723 -1.504449  0.735045
175  0.683183 -1.205205 -3.379096  0.532414
252  0.857240  0.476724  3.448594 -0.191493
256 -2.055646 -1.469576 -0.350372  3.137984
358  0.930649  3.209693 -1.810962 -0.102645
368  0.171423 -3.060033  0.060507 -0.195369
457  0.018857 -0.275076  3.141148 -0.485580
484  0.557679  0.229425  3.719684 -0.999360
609 -0.659607 -3.263429  0.907035  0.667529
758 -3.367719  2.725863 -0.388598 -0.999087

In [56]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [57]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014650    -0.009357    -0.011759    -0.040295
std       0.974754     0.978113     0.999557     1.002445
min      -3.000000    -3.000000    -3.000000    -2.932212
25%      -0.682590    -0.677608    -0.683984    -0.722428
50%      -0.035123    -0.006947     0.019384    -0.013082
75%       0.657671     0.651089     0.659703     0.682857
max       2.999542     3.000000     3.000000     3.000000

In [58]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0  1.0  1.0

## Permutation and Random Sampling

In [69]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [70]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [71]:
sampler = np.random.permutation(5)

In [72]:
sampler

array([1, 3, 0, 2, 4])

In [73]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [83]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [77]:
choices = pd.Series([5, 7, -1, 6, 4])

In [81]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [79]:
draws = choices.sample(n=10, replace=True)

In [80]:
draws

3    6
4    4
0    5
3    6
4    4
0    5
2   -1
2   -1
0    5
4    4
dtype: int64

## Computing Indicator/Dummy Variables

In [84]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [85]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [87]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [86]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [88]:
df_with_dummy = df[['data1']].join(dummies)

In [89]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [90]:
mnames = ['movie_id', 'title', 'genres']

In [95]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')

In [96]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [97]:
all_genres = []

In [98]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [99]:
genres = pd.unique(all_genres)

In [100]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [101]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [103]:
zero_matrix.shape

(3883, 18)

In [104]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [105]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [106]:
gen = movies.genres[0]

In [108]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [109]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [114]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [116]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [117]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [119]:
movies_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [120]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [121]:
np.random.seed(12345)

In [122]:
values = np.random.randn(10)

In [123]:
values

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057,
        1.39340583,  0.09290788,  0.28174615,  0.76902257,  1.24643474])

In [124]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [125]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           0
1           0           0           1           0           0
2           0           0           0           0           0
3           0           0           0           0           0
4           0           0           0           0           0
5           0           0           0           0           0
6           1           0           0           0           0
7           0           1           0           0           0
8           0           0           0           1           0
9           0           0           0           0           0

# String Manipulation

## String Object Methods

In [126]:
val = 'a,b, guido'

In [127]:
val.split(',')

['a', 'b', ' guido']

In [128]:
pieces = [x.strip() for x in val.split(',')]

In [129]:
pieces

['a', 'b', 'guido']

In [130]:
first, second, third = pieces

In [131]:
first + '::' + second + '::' + third

'a::b::guido'

In [132]:
'::'.join(pieces)

'a::b::guido'

In [134]:
'guido' in val

True

In [135]:
val.index(',')

1

In [137]:
val.find(':')

-1

In [138]:
val.index(':')

ValueError: substring not found

In [139]:
val.count(',')

2

In [140]:
val.replace(',', '::')

'a::b:: guido'

In [142]:
val.replace(',', '')

'ab guido'

## Regular Expressions

In [143]:
import re

In [144]:
text = "foo    bar\t baz  \tqux"

In [146]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [147]:
regex = re.compile('\s+')

In [148]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [149]:
regex.findall(text)

['    ', '\t ', '  \t']

In [151]:
text = """
Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [152]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [154]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [155]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [156]:
m = regex.search(text)

In [157]:
m

In [158]:
text[m.start():m.end()]

'dave@google.com'

In [159]:
print(regex.match(text))

None

In [160]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [161]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [162]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [164]:
m = regex.match('wesm@bright.net')

In [166]:
m.groups()

('wesm', 'bright', 'net')

In [169]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [171]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [172]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [173]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [174]:
data = pd.Series(data)

In [175]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [176]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [177]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [178]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [179]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [180]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [181]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [182]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [185]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object